A. Ещё одна задача о двух числах
ограничение по времени на тест1 секунда
ограничение по памяти на тест256 мегабайт
вводстандартный ввод
выводстандартный вывод
Вам даны два целых числа a и b.

За один ход вы можете выбрать некоторое целое число k от 1 до 10 и прибавить его к a или вычесть из a. Другими словами, вы выбираете целое число k∈[1;10] и выполняете a:=a+k или a:=a−k. Вы можете использовать различные значения k во время разных ходов.

Ваша задача — найти минимальное количество ходов, необходимое, чтобы получить b из a.

Вам необходимо ответить на t независимых наборов тестовых данных.

Входные данные
Первая строка теста содержит одно целое число t (1≤t≤2⋅104) — количество наборов тестовых данных. Затем следуют t наборов тестовых данных.

Единственная строка набора тестовых данных содержит два целых числа a и b (1≤a,b≤109).

Выходные данные
Для каждого набора тестовых данных выведите ответ на него: минимальное количество ходов, необходимое, чтобы получить b из a.

import math
 
count = input().split()
count = " ".join(count)
count = int(count)
 
n = 0 
while n < count:
    a,b = map(int, input().split())
    module = abs(a- b)
    if module % 10 == 0:
        print(int(module / 10))
    else:
        print(int(math.floor(module / 10)) + 1) 
    n = n + 1    
    
→Протокол тестирования
Test: #1, время: 15 мс., память: 0 КБ, код возврата: 0, код возврата чекера: 0, вердикт: OK
Ввод
6
5 5
13 42
18 4
1337 420
123456789 1000000000
100500 9000
Вывод
0
3
2
92
87654322
9150
