A. Сумма
ограничение по времени на тест2 секунды
ограничение по памяти на тест64 мегабайта
вводстандартный ввод
выводстандартный вывод
Заданы два действительных числа a и b. Напишите программу, которая вычислит a + b.

Входные данные
В первой строке входных данных два действительных числа a и b ( - 1000 ≤ a, b ≤ 1000).

Выходные данные
Выведите значение a + b с точностью не менее четырех десятичных знаков.

a, d = map(float, input().split())
print(a+d)
→Протокол тестирования
Test: #1, время: 30 мс., память: 0 КБ, код возврата: 0, код возврата чекера: 0, вердикт: OK
Ввод
1.1 2.2
Вывод
3.3000000000000003
