A. Сумма
ограничение по времени на тест2 секунды
ограничение по памяти на тест64 мегабайта
вводстандартный ввод
выводстандартный вывод
Заданы два действительных числа a и b. Напишите программу, которая вычислит a + b.

Входные данные
В первой строке входных данных два действительных числа a и b ( - 1000 ≤ a, b ≤ 1000).

Выходные данные
Выведите значение a + b с точностью не менее четырех десятичных знаков.

a, d = map(float, input().split())
print(a+d)
